driver-tests/bpelse/eventHandlers/onAlarmJbi/src/jbiServiceUnits/onAlarm/onAlarmWithFlow/onAlarmWithFlowWSDL.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions targetNamespace="http://j2ee.netbeans.org/wsdl/onAlarmWithFlowWSDL"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://j2ee.netbeans.org/wsdl/onAlarmWithFlowWSDL" name="onAlarmWithFlowWSDL" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype">
    <types/>
    <message name="onAlarmWithFlowWSDLOperationRequest">
        <part name="part1" type="xsd:string"/>
    </message>
    <message name="onAlarmWithFlowWSDLOperationReply">
        <part name="part1" type="xsd:string"/>
    </message>
    <portType name="onAlarmWithFlowWSDLPortType">
        <wsdl:operation name="onAlarmWithFlowWSDLOperation">
            <wsdl:input name="input1" message="tns:onAlarmWithFlowWSDLOperationRequest"/>
            <wsdl:output name="output1" message="tns:onAlarmWithFlowWSDLOperationReply"/>
        </wsdl:operation>
    </portType>
    <binding name="onAlarmWithFlowWSDLBinding" type="tns:onAlarmWithFlowWSDLPortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <wsdl:operation name="onAlarmWithFlowWSDLOperation">
            <soap:operation/>
            <wsdl:input name="input1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/onAlarmWithFlowWSDL"/>
            </wsdl:input>
            <wsdl:output name="output1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/onAlarmWithFlowWSDL"/>
            </wsdl:output>
        </wsdl:operation>
    </binding>
    <service name="onAlarmWithFlowWSDLService">
        <wsdl:port name="onAlarmWithFlowWSDLPort" binding="tns:onAlarmWithFlowWSDLBinding">
            <soap:address location="http://localhost:${HttpDefaultPort}/onAlarmWithFlowWSDLService/onAlarmWithFlowWSDLPort"/>
        </wsdl:port>
    </service>
    <plnk:partnerLinkType name="onAlarmWithFlowWSDL1">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="onAlarmWithFlowWSDLPortTypeRole" portType="tns:onAlarmWithFlowWSDLPortType"/>
    </plnk:partnerLinkType>
</definitions>
