driver-tests/bpelse/eventHandlers/onAlarmJbi/test/onAlarmWithFlow/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:onal="http://j2ee.netbeans.org/wsdl/onAlarmWithFlowWSDL">
  <soapenv:Body>
    <onal:onAlarmWithFlowWSDLOperation>
      <part1>*Test OnAlarmWithFlow-input*</part1>
    </onal:onAlarmWithFlowWSDLOperation>
  </soapenv:Body>
</soapenv:Envelope>